//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//*************************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//*************************************************************************
// Revision History
// ----------------
// $Log: $
// 
//*************************************************************************
//<AMI_FHDR_START>
//
// Name:        NB.uni
//
// Description: North Bridge setup string definitions
//
//<AMI_FHDR_END>
//*************************************************************************

/=#
#include "VFR.uni"

#string STR_NB_FORM                     #language eng "System Agent (SA) Configuration"
#string STR_NB_FORM_HELP                #language eng "System Agent (SA) Parameters"
//----------------------------------------------------------------------------
// Host Bridge Configuration
//----------------------------------------------------------------------------
#string STR_DMI_CONFIGURATION_TITLE     #language eng "DMI Configuration" 
#string STR_DMI_CONFIGURATION_HELP      #language eng "Control various DMI functions." 

#string STR_INT_IGFXFORCEDISABLE_PROMPT #language eng "IGfx Fource Disable Support"
#string STR_INT_IGFXFORCEDISABLE_HELP   #language eng "Enable/Disable IGfx Fource Disable Support."

#string STR_INT_GRAPHICS_PROMPT         #language eng "Internal Graphics"
#string STR_INT_GRAPHICS_HELP          	#language eng "Keep IGD enabled based on the setup options."

#string STR_MCH_VTD_PROMPT              #language eng "VT-d"
#string STR_MCH_VTD_HELP                #language eng "Check to enable VT-d function on MCH."

#string STR_VTD_QIE_PROMPT              #language eng "Queued Invalidation"
#string STR_VTD_QIE_HELP                #language eng "Enable Queued Invalidation."

#string STR_VTD_IRE_PROMPT              #language eng "Interrupt Remapping"
#string STR_VTD_IRE_HELP                #language eng "Enable Interrupt Remapping."

#string STR_SA_CHAP_DEVICE_PROMPT       #language eng "CHAP Device (B0:D7:F0)"
#string STR_SA_CHAP_DEVICE_HELP         #language eng "Enable or disable SA CHAP Device."

#string STR_SA_THERMAL_DEVICE_PROMPT    #language eng "Thermal Device (B0:D4:F0)"
#string STR_SA_THERMAL_DEVICE_HELP      #language eng "Enable or disable SA Thermal Device."

#string STR_SA_AUDIO_DEVICE_PROMPT      #language eng "CPU SA Audio Device (B0:D3:F0)"
#string STR_SA_AUDIO_DEVICE_HELP        #language eng "Enable or disable CPU SA Audio Device."

#string STR_SA_HDMI_CODEC_PORTB_PROMPT     #language eng "    SA HDMI codec Port B"
#string STR_SA_HDMI_CODEC_PORTC_PROMPT     #language eng "    SA HDMI codec Port C"
#string STR_SA_HDMI_CODEC_PORTD_PROMPT     #language eng "    SA HDMI codec Port D"
#string STR_SA_HDMI_CODEC_PORT_HELP        #language eng "Enable or disable internal HDMI codec Port for CPU SA Audio Device."


//  NB CRID Work Around
#string STR_ENABLE_NB_CRID_PROMPT       #language eng "Enable NB CRID"
#string STR_ENABLE_NB_CRID_HELP         #language eng "Enable or disable NB CRID WorkAround."

#string STR_ENABLE_NB_BDAT_PROMPT       #language eng "BDAT ACPI Table Support"
#string STR_ENABLE_NB_BDAT_HELP         #language eng "Enables support for the BDAT ACPI table."

#string STR_CSTATE_PREWAKE_PROMPT       #language eng "C-State Pre-Wake"
#string STR_CSTATE_PREWAKE_HELP         #language eng "Controls C-State Pre-Wake feature for ARAT, in SSKPD[57]."

#string STR_IGFX_FREQ_PROMPT            #language eng  "IGfx Frequency"
#string STR_IGFX_FREQ_VALUE             #language eng  "N/A"

#string STR_GRAPHICS_TURBO_IMAX         #language eng "Graphics Turbo IMON Current"
#string STR_GRAPHICS_TURBO_IMAX_HELP    #language eng "Graphics turbo IMON current values supported (14-31)"

#string STR_IGPU_PORT_CONFIG            #language eng "iGPU Port Configuration"
#string STR_IGPU_PORT_CONFIG_HELP       #language eng "Select to enable or disable iGPU ports "  

// Digital port mode options.
#string STR_IGFX_DIGITAL_PORT_B         #language eng "iGPU Digital Port B Mode"
#string STR_IGFX_DIGITAL_PORT_B_HELP    #language eng "Select mode for iGPU Digital Port B."
#string STR_IGFX_DIGITAL_PORT_C         #language eng "iGPU Digital Port C Mode"
#string STR_IGFX_DIGITAL_PORT_C_HELP    #language eng "Select mode for iGPU Digital Port C."
#string STR_IGFX_DIGITAL_PORT_D         #language eng "iGPU Digital Port D Mode"
#string STR_IGFX_DIGITAL_PORT_D_HELP    #language eng "Select mode for iGPU Digital Port D."
#string STR_IGFX_PORT_SHARED            #language eng "Port is fully muxed with dGPU"
#string STR_IGFX_PORT_IGPU_ONLY         #language eng "Port is not muxed with dGPU"
#string STR_IGFX_PORT_HPD_ONLY          #language eng "Port supports HPD only"

#string STR_TCL_VALUE                   #language eng "tCL"
#string STR_TCL_VALUE_HELP              #language eng "Cas Latency Range 4-18."
#string STR_TRCD_VALUE                  #language eng "tRCD"
#string STR_TRCD_VALUE_HELP             #language eng "Row to Col Delay Range 1-38."
#string STR_TRP_VALUE                   #language eng "tRP"
#string STR_TRP_VALUE_HELP              #language eng "Ras Precharge Range 1-38."
#string STR_TRAS_VALUE                  #language eng "tRAS"
#string STR_TRAS_VALUE_HELP             #language eng "Ras Active Time 1-586."
#string STR_TWR_VALUE                   #language eng "tWR"
#string STR_TWR_VALUE_HELP              #language eng "Min Write Recovery Time Range 1-38."
#string STR_TRFC_VALUE                  #language eng "tRFC"
#string STR_TRFC_VALUE_HELP             #language eng "Min Refresh Recovery Delay Time 1-9363."
#string STR_TRRD_VALUE                  #language eng "tRRD"
#string STR_TRRD_VALUE_HELP             #language eng "Min Row Active to Row Active Delay Time 1-38."
#string STR_TWTR_VALUE                  #language eng "tWTR"
#string STR_TWTR_VALUE_HELP             #language eng "Min Internal Write to Read Command Delay Time 1-38."
#string STR_TRTP_VALUE                  #language eng "tRTP"
#string STR_TRTP_VALUE_HELP             #language eng "Min Internal Read to Precharge Command Delay Time 1-38."
#string STR_TRC_VALUE                   #language eng "tRC"
#string STR_TRC_VALUE_HELP              #language eng "Min Active to Active/Refresh Delay Time (tRCmin) 1-586."
#string STR_TFAW_VALUE                  #language eng "tFAW"
#string STR_TFAW_VALUE_HELP             #language eng "Min Four Activate Window Delay Time 1-586."
#string STR_TCWL_VALUE                  #language eng "tCWL"
#string STR_TCWL_VALUE_HELP             #language eng "Minimum Cas Write Latency, Range 5-12."
#string STR_TREFI_VALUE                 #language eng "tREFI"
#string STR_TREFI_VALUE_HELP            #language eng "Maximum tREFI Time , Range 1-10000."
#string STR_TRPAB_VALUE                 #language eng "tRPab"
#string STR_TRPAB_VALUE_HELP            #language eng "Row Precharge Delay Time for all banks , Range 4-18."

#string STR_MEMORY_TWR_NAME             #language eng "Write Recovery Time(tWR)"
#string STR_MEMORY_TWR_HELP             #language eng "DRAM Write Recovery Time"
#string STR_MEMORY_TWR_VALUE            #language eng "Not Present"
#string STR_MEMORY_TRFC_NAME            #language eng "Row Refresh Cycle Timea(tRFC)"
#string STR_MEMORY_TRFC_HELP            #language eng "DRAM Row Refresh Cycle Time"
#string STR_MEMORY_TRFC_VALUE           #language eng "Not Present"
#string STR_MEMORY_TWTR_NAME            #language eng "Write to Read Delay(tWTR)"
#string STR_MEMORY_TWTR_HELP            #language eng "DRAM Write to Read Delay"
#string STR_MEMORY_TWTR_VALUE           #language eng "Not Present"
#string STR_MEMORY_TRRD_NAME            #language eng "Active to Active Delay(tRRD)"
#string STR_MEMORY_TRRD_HELP            #language eng "DRAM Row Active to Row Active Delay"
#string STR_MEMORY_TRRD_VALUE           #language eng "Not Present"
#string STR_MEMORY_TRTP_NAME            #language eng "Read CAS# Precharge(tRTP)"
#string STR_MEMORY_TRTP_HELP            #language eng "DRAM Read CAS# Precharge"
#string STR_MEMORY_TRTP_VALUE           #language eng "Not Present"

// DMI Configuration
#string STR_DMI_INFO_HELP                      #language eng "DMI Link and Speed Information"
#string STR_DMI_INFO_NAME                      #language eng "DMI"
#string STR_DMI_INFO_VALUE                     #language eng "N/A"

#string STR_DMI_VC1_PROMPT                      #language eng "DMI Vc1 Control" 
#string STR_DMI_VC1_HELP                        #language eng "Enable or disable DMI Vc1"
#string STR_DMI_VCP_PROMPT                      #language eng "DMI Vcp Control" 
#string STR_DMI_VCP_HELP                        #language eng "Enable or disable DMI Vcp"
#string STR_DMI_VCM_PROMPT                      #language eng "DMI Vcm Control" 
#string STR_DMI_VCM_HELP                        #language eng "Enable or disable DMI Vcm"

#string STR_DMI_ASPM_PROMPT                     #language eng "DMI Link ASPM Control" 
#string STR_DMI_ASPM_HELP                       #language eng "Enable or disable the control of Active State Power Management on SA side of the DMI Link." 
#string STR_DMI_ASPM_L0S_STRING                 #language eng "L0s"
#string STR_DMI_ASPM_L1_STRING                  #language eng "L1"
#string STR_DMI_ASPM_L0SL1_STRING               #language eng "L0sL1"
#string STR_DMI_GEN2_PROMPT                     #language eng "DMI Gen 2"
#string STR_DMI_GEN2_HELP                       #language eng "Enable or disable DMI Gen 2/nAuto means Disabled for IVB A0 MB/DT and IVB B0 MB, Enabled for other CPUs."
#string STR_DMI_DE_EMPHASIS_PROMPT              #language eng "DMI De-emphasis Control"
#string STR_DMI_DE_EMPHASIS_HELP                #language eng "Configure the De-emphasis control on DMI"
#string STR_DMI_IOT_PROMPT                      #language eng "DMI IOT"
#string STR_DMI_IOT_HELP                        #language eng "Enable/Disable DMI IOT"

#string STR_DMI_EXT_SYNCH_PROMPT                #language eng "DMI Extended Synch Control"
#string STR_DMI_EXT_SYNCH_HELP                  #language eng "Enable DMI Extended Synchronization."

#string STR_DEBUG_ALIGN_PROMPT                  #language eng "Debug Align"
#string STR_DEBUG_ALIGN_HELP                    #language eng "Enable the Debug Align VDM on PEG and DMI"

#string STR_AUTO_NSG_PROMPT                     #language eng "Stop Grant Configuration" 
#string STR_AUTO_NSG_HELP                       #language eng "Automatic or manual Stop Grant Configuration" 

#string STR_NUM_STOP_GRANT_PROMPT               #language eng "Number of Stop Grant Cycles" 
#string STR_NUM_STOP_GRANT_HELP                 #language eng "Selects number of Stop-Grant Cycles." 

#string STR_SA_VTD_NAME                         #language eng "VT-d Capability"
#string STR_SA_VTD_HELP                         #language eng "VT-d Capability"
#string STR_SA_VTD_VALUE                        #language eng "Unsupported"

#string STR_MRC_REV_HELP                        #language eng "Memory RC Version"
#string STR_MRC_REV_NAME                        #language eng "Memory RC Version"
#string STR_MRC_REV_VALUE                       #language eng "N/A" //dynamically updated

#string STR_SA_BRIDGE_HELP                      #language eng "System Agent Bridge name."
#string STR_SA_BRIDGE_NAME                      #language eng "System Agent Bridge Name"
#string STR_SA_BRIDGE_VALUE                     #language eng "Haswell" //dynamically updated

#string STR_SA_RC_REV_HELP                      #language eng "System Agent RC Version"
#string STR_SA_RC_REV_NAME                      #language eng "System Agent RC Version"
#string STR_SA_RC_REV_VALUE                     #language eng "N/A" //dynamically updated
//----------------------------------------------------------------------------
// On Chip VGA Configuration
//----------------------------------------------------------------------------

#string STR_INTEL_IGFX_FORM            #language eng "Graphics Configuration"
#string STR_INTEL_IGFX_HELP            #language eng "Config Graphics Settings."

#string STR_CHIP_IGFX_VBIOS_REV_HELP                  #language eng "IGFX VBIOS Version"
#string STR_CHIP_IGFX_VBIOS_REV_NAME                  #language eng "IGFX VBIOS Version"
#string STR_CHIP_IGFX_VBIOS_REV_VALUE                 #language eng "N/A" //dynamically updated

#string STR_NB_NON_COMPLIANCE                   #language eng "Detect Non-Compliance Device"
#string STR_NB_NON_COMPLIANCE_HELP              #language eng "Detect Non-Compliance PCI Express Device in PEG"

// DVMT5.0 Graphics Memory
#string STR_DVMT50_TITLE                        #language eng "DVMT5.0 Graphic memory setting"
#string STR_DVMT50_PRE_ALLOC                    #language eng "DVMT Pre-Allocated"
#string STR_DVMT50_PRE_ALLOC_0M                 #language eng "0M"
#string STR_DVMT50_PRE_ALLOC_32M                #language eng "32M"
#string STR_DVMT50_PRE_ALLOC_64M                #language eng "64M"
#string STR_DVMT50_PRE_ALLOC_96M                #language eng "96M"
#string STR_DVMT50_PRE_ALLOC_128M               #language eng "128M"
#string STR_DVMT50_PRE_ALLOC_160M               #language eng "160M"
#string STR_DVMT50_PRE_ALLOC_192M               #language eng "192M"
#string STR_DVMT50_PRE_ALLOC_224M               #language eng "224M"
#string STR_DVMT50_PRE_ALLOC_256M               #language eng "256M"
#string STR_DVMT50_PRE_ALLOC_288M               #language eng "288M"
#string STR_DVMT50_PRE_ALLOC_320M               #language eng "320M"
#string STR_DVMT50_PRE_ALLOC_352M               #language eng "352M"
#string STR_DVMT50_PRE_ALLOC_384M               #language eng "384M"
#string STR_DVMT50_PRE_ALLOC_416M               #language eng "416M"
#string STR_DVMT50_PRE_ALLOC_448M               #language eng "448M"
#string STR_DVMT50_PRE_ALLOC_480M               #language eng "480M"
#string STR_DVMT50_PRE_ALLOC_512M               #language eng "512M"
#string STR_DVMT50_PRE_ALLOC_1024M              #language eng "1024M"
#string STR_DVMT50_PRE_ALLOC_HELP               #language eng "Select DVMT 5.0 Pre-Allocated (Fixed) Graphics Memory size used by the Internal Graphics Device."

#string STR_DVMT50_DVMT                         #language eng "DVMT Total Gfx Mem"
#string STR_DVMT50_DVMT_HELP                    #language eng "Select DVMT5.0 Total Graphic Memory size used by the Internal Graphics Device."
#string STR_DVMT50_ALLOC_128                    #language eng "128M"
#string STR_DVMT50_ALLOC_256                    #language eng "256M"
#string STR_DVMT50_ALLOC_MAX                    #language eng "MAX"

#string STR_ACTIVE_LFP                          #language eng "Active LFP"        
#string STR_ACTIVE_LFP_HELP                     #language eng "Select the Active LFP Configuration.\n\nNo LVDS:VBIOS does not enable LVDS.\nInt-LVDS:VBIOS enables LVDS driver by Integrated encoder.\nSDVO LVDS:VBIOS enables LVDS driver by SDVO encoder.\neDP Port-A:LFP Driven by Int-DisplayPort encoder from Port-A.\neDP Port-D:LFP Driven by Int-DisplayPort encoder from Port-D(through PCH)."        
#string STR_NO_LVDS_STRING                      #language eng "No LVDS"        
#string STR_INT_LVDS_STRING                     #language eng "Int-LVDS"        
#string STR_SDVO_LVDS_STRING                    #language eng "SDVO LVDS"        
#string STR_EDPA_LFP_STRING                     #language eng "eDP Port-A"        
#string STR_EDPD_LFP_STRING                     #language eng "eDP Port-D"        
#string STR_VIDEO_ASPM_PROMPT                   #language eng "  ASPM"
#string STR_VIDEO_ASPM_HELP                     #language eng "Control ASPM support for the PEG Device. This has no effect if PEG is not the currently active device."

#string STR_PANELTYPE_PROMPT                    #language eng "LCD Panel Type"
#string STR_PANELTYPE_HELP                      #language eng "Select LCD panel used by Internal Graphics Device by selecting the appropriate setup item."
#string STR_PANELTYPE_01                        #language eng "640x480       LVDS"
#string STR_PANELTYPE_02                        #language eng "800x600       LVDS"
#string STR_PANELTYPE_03                        #language eng "1024x768      LVDS1"
#string STR_PANELTYPE_04                        #language eng "1280x1024     LVDS"
#string STR_PANELTYPE_05                        #language eng "1400x1050(RB) LVDS1"
#string STR_PANELTYPE_06                        #language eng "1400x1050     LVDS2"
#string STR_PANELTYPE_07                        #language eng "1600x1200     LVDS"
#string STR_PANELTYPE_08                        #language eng "1366x768      LVDS"
#string STR_PANELTYPE_09                        #language eng "1680x1050     LVDS"
#string STR_PANELTYPE_10                        #language eng "1920x1200     LVDS"
#string STR_PANELTYPE_11                        #language eng "1440x900      LVDS"
#string STR_PANELTYPE_12                        #language eng "1600x900      LVDS"
#string STR_PANELTYPE_13                        #language eng "1024x768      LVDS2"
#string STR_PANELTYPE_14                        #language eng "1280x800      LVDS"
#string STR_PANELTYPE_15                        #language eng "1920x1080     LVDS"
#string STR_PANELTYPE_16                        #language eng "2048x1536     LVDS"

#string STR_SDVO_PANELTYPE_PROMPT               #language eng "SDVO-LFP Panel Type"
#string STR_SDVO_PANELTYPE_HELP                 #language eng "Select SDVO panel used by Internal Graphics Device by selecting the appropriate setup item."
#string STR_SDVO_PANELTYPE_01                   #language eng "1024x768     SDVO-LFP"
#string STR_SDVO_PANELTYPE_02                   #language eng "1280x1024    SDVO-LFP"
#string STR_SDVO_PANELTYPE_03                   #language eng "1400x1050    SDVO-LFP"
#string STR_SDVO_PANELTYPE_04                   #language eng "1600x1200    SDVO-LFP"

#string STR_PANELSCALING_PROMPT                 #language eng "Panel Scaling"
#string STR_PANELSCALING_HELP                   #language eng "Select the LCD panel scaling option used by the Internal Graphics Device."
#string STR_PANELSCALING_AUTO                   #language eng "Auto"
#string STR_PANELSCALING_FORCE                  #language eng "Force Scaling"
#string STR_PANELSCALING_OFF                    #language eng "Off"
#string STR_PANELSCALING_ASPECT_RATIO           #language eng "Maintain Aspect Ratio"

#string STR_VIDEO_LCD_BLC                       #language eng "Backlight Control"
#string STR_VIDEO_LCD_BLCHELP                   #language eng "Back Light Control Setting" 
#string STR_VIDEO_LCD_BLC1                      #language eng "PWM Inverted"
#string STR_VIDEO_LCD_BLC2                      #language eng "PWM Normal"
#string STR_VIDEO_LCD_BLC3                      #language eng "GMBus Inverted"
#string STR_VIDEO_LCD_BLC4                      #language eng "GMBus Normal"

#string STR_VIDEO_LCD_IBIA                      #language eng "BIA"
#string STR_VIDEO_LCD_IBIAA                     #language eng "Auto"
#string STR_VIDEO_LCD_IBIAD                     #language eng "Disabled"
#string STR_VIDEO_LCD_IBIAL1                    #language eng "Level 1"
#string STR_VIDEO_LCD_IBIAL2                    #language eng "Level 2"
#string STR_VIDEO_LCD_IBIAL3                    #language eng "Level 3"
#string STR_VIDEO_LCD_IBIAL4                    #language eng "Level 4"
#string STR_VIDEO_LCD_IBIAL5                    #language eng "Level 5"
#string STR_VIDEO_LCD_IBIAHLP                   #language eng ">>Auto: GMCH Use VBT Default;             >>Level n: Enabled with Selected Aggressiveness Level."
#string STR_VIDEO_LCD_SSCC                      #language eng "Spread Spectrum clock Chip"
#string STR_VIDEO_LCD_SSCC1                     #language eng "Off"
#string STR_VIDEO_LCD_SSCC2                     #language eng "Hardware"
#string STR_VIDEO_LCD_SSCC3                     #language eng "Software"
#string STR_VIDEO_LCD_SSCCHLP                   #language eng ">>Hardware: Spread is controlled by chip; >>Software: Spread is controlled by BIOS."

#string STR_VIDEO_TV1_STANDARD                  #language eng "TV1 Standard"
#string STR_TV1_STANDARD_HELP         	        #language eng "Select the ability to configure a TV Format"
#string STR_VIDEO_TV2_STANDARD                  #language eng "TV2 Standard"
#string STR_TV2_STANDARD_HELP         	        #language eng "Select the ability to configure a TV Minor Format"
#string STR_VIDEO_TV_STANDARD01                 #language eng "VBIOS default"                       
#string STR_VIDEO_TV_STANDARD02                 #language eng "NTSC_M       "                       
#string STR_VIDEO_TV_STANDARD03                 #language eng "NTSC_M_J     "                       
#string STR_VIDEO_TV_STANDARD04                 #language eng "NTSC_433     "                       
#string STR_VIDEO_TV_STANDARD05                 #language eng "PAL_B        "                       
#string STR_VIDEO_TV_STANDARD06                 #language eng "PAL_G        "                       
#string STR_VIDEO_TV_STANDARD07                 #language eng "PAL_D        "                       
#string STR_VIDEO_TV_STANDARD08                 #language eng "PAL_H        "                       
#string STR_VIDEO_TV_STANDARD09                 #language eng "PAL_I        "                       
#string STR_VIDEO_TV_STANDARD10                 #language eng "PAL_M        "                       
#string STR_VIDEO_TV_STANDARD11                 #language eng "PAL_N        "                       
#string STR_VIDEO_TV_STANDARD12                 #language eng "SECAM_L      "                       
#string STR_VIDEO_TV_STANDARD13                 #language eng "SECAM_B      "                       
#string STR_VIDEO_TV_STANDARD14                 #language eng "SECAM_D      "                       
#string STR_VIDEO_TV_STANDARD15                 #language eng "SECAM_G      "                       
#string STR_VIDEO_TV_STANDARD16                 #language eng "SECAM_H      "                       
#string STR_VIDEO_TV_STANDARD17                 #language eng "SECAM_K      "                       
#string STR_VIDEO_TV_STANDARD18                 #language eng "HDTV_STD_SMPTE_240M_1080i59 "        
#string STR_VIDEO_TV_STANDARD19                 #language eng "HDTV_STD_SMPTE_240M_1080i60 "        
#string STR_VIDEO_TV_STANDARD20                 #language eng "HDTV_STD_SMPTE_295M_1080i50 "        
#string STR_VIDEO_TV_STANDARD21                 #language eng "HDTV_STD_SMPTE_295M_1080p50 "        
#string STR_VIDEO_TV_STANDARD22                 #language eng "HDTV_STD_SMPTE_296M_720p50  "        
#string STR_VIDEO_TV_STANDARD23                 #language eng "HDTV_STD_SMPTE_296M_720p60  "        
#string STR_VIDEO_TV_STANDARD24                 #language eng "HDTV_STD_CEAEIA_7702A_480p60"        
#string STR_VIDEO_TV_STANDARD25                 #language eng "HDTV_STD_CEAEIA_7702A_480i60"    

#string STR_ACPI_ALS_ENABLE                     #language eng "ALS Support"
#string STR_ACPI_ALS_ENABLE_HELP                #language eng "Valid only for ACPI.\n\nLegacy = ALS Support through the IGD INT10 function.\n\nACPI = ALS support through an ACPI ALS driver."

#string STR_LOW_POWER_MODE                      #language eng "Gfx Low Power Mode"
#string STR_LOW_POWER_MODE_HELP                 #language eng "This option is applicable for SFF only."

#string STR_PANEL_POWER_ENABLE                  #language eng "Panel Power Enable"
#string STR_PANEL_POWER_ENABLE_HELP             #language eng "Enable/Disable forcing of Panel Power in the BIOS."

#string STR_NB_MEM_ALIGN                        #language eng "Low MMIO Align"
#string STR_NB_MEM_ALIGN_HELP                   #language eng "Low MMIO resources align at 64MB/1024MB"
#string STR_NB_MEM_ALIGN_64M                    #language eng "64M"
#string STR_NB_MEM_ALIGN_1024M                  #language eng "1024M"

// Power GT
#string STR_GT_POWER_CONFIG_FORM_TITLE          #language eng "GT - Power Management Control"
#string STR_GT_POWER_CONFIG_FORM_HELP           #language eng "GT - Power Management Control Options"
#string STR_VIDEO_RS2_PROMPT                    #language eng "RC6(Render Standby)"
#string STR_VIDEO_RS2_HELP                      #language eng "Check to enable render standby support."
#string STR_VIDEO_DEEP_RS2_PROMPT               #language eng "RC6+(Deep RC6)"
#string STR_VIDEO_DEEP_RS2_HELP                 #language eng "Check to enable Deep RC6 (RC6+) support."
#string STR_GT_OC_SUPPORT_PROMPT                #language eng  "GT OverClocking Support"
#string STR_GT_OC_SUPPORT_HELP                  #language eng  "Enable or disable GT OverClocking Support"
#string STR_GT_OC_FREQUENCY_PROMPT              #language eng  "GT OverClocking Frequency"
#string STR_GT_OC_FREQUENCY_HELP                #language eng  "Overclocked RP0 Frequency (MLC Clk) in multiples of 50 MHz"
#string STR_GT_OC_VOLTAGE_PROMPT                #language eng  "GT OverClocking Voltage"
#string STR_GT_OC_VOLTAGE_HELP                  #language eng  "Extra voltage needed above the original RP0 voltage - The unit is 1/256 volt"

#string STR_PROCESSOR_GT_STRING                 #language eng "GT Info"
#string STR_PROCESSOR_GT_VALUE                  #language eng "Not Applicable"
#string STR_PROCESSOR_GT_HELP                   #language eng "Processor GT Info. Only valid if SNB stepping is D0 or above."

#string STR_GTT_SIZE                            #language eng "GTT Size"
#string STR_GTT_SIZE_HELP                       #language eng "Select the GTT Size "
#string GTT_SIZE_1MB                            #language eng "1MB"
#string GTT_SIZE_2MB                            #language eng "2MB"

#string STR_APERTURE_SIZE                       #language eng "Aperture Size"
#string STR_APERTURE_SIZE_HELP                  #language eng "Select the Aperture Size"
#string APERTURE_SIZE_128MB                     #language eng "128MB"
#string APERTURE_SIZE_256MB                     #language eng "256MB"
#string APERTURE_SIZE_512MB                     #language eng "512MB"

//----------------------------------------------------------------------------
// Other Configuration
//----------------------------------------------------------------------------
#string STR_PRIMARY_VIDEO                       #language eng "Primary Display"
#string STR_PRIMARY_VIDEO_HELP1                 #language eng "Select which of Auto/IGFX/PEG/PCIE/SG Graphics device should be Primary Display Or select SG for Switchable Gfx."
#string STR_PRIMARY_VIDEO_HELP2                 #language eng "Select which of Auto/IGFX/PCIE/SG Graphics device should be Primary Display Or select SG for Switchable Gfx."
#string STR_PRIMARY_VIDEO_HELP3                 #language eng "Select which of Auto/IGFX/PEG/PCIE Graphics device should be Primary Display Or select SG for Switchable Gfx."
#string STR_PRIMARY_VIDEO_HELP4                 #language eng "Select which of Auto/IGFX/PCIE Graphics device should be Primary Display Or select SG for Switchable Gfx."
#string STR_PRIMARY_VIDEO_HELP5                 #language eng "Select which of Auto/PEG/PCIE Graphics device should be Primary Display Or select SG for Switchable Gfx."
#string STR_IGFX_STRING                         #language eng "IGFX"
#string STR_PEG_STRING                          #language eng "PEG"
#string STR_PCIE_STRING                         #language eng "PCIE"
#string STR_SG_STRING                           #language eng "SG"             

#string STR_LOAD_IGFX_VBIOS                     #language eng "Load IGFX VBIOS"
#string STR_LOAD_IGFX_VBIOS_HELP                #language eng "Enable or disable CSM load IGFX VBIOS."
#string STR_LOAD_PEG_VBIOS                      #language eng "Load PEG VBIOS"
#string STR_LOAD_PEG_VBIOS_HELP                 #language eng "Enable or disable CSM load PEG VBIOS."
//
//IGD - LCD Control Sub-Menu
//
#string STR_IGFX_LCD                            #language eng "LCD Control"
#string STR_IGFX_FDI                            #language eng "FDI Configuration"

#string STR_VIDEO_BT_PROMPT                     #language eng "Primary IGFX Boot Display"
#string STR_VIDEO_BT_HELP                       #language eng "Select the Video Device which will be activated during POST.\nThis has no effect if external graphics present.\nSecondary boot display selection will appear based on your selection.\nVGA modes will be supported only on primary display\n"
#string STR_VIDEO_BT_DEFAULT                    #language eng "VBIOS Default"
#string STR_VIDEO_BT_CRT                        #language eng "CRT"
#string STR_VIDEO_BT_LFP                        #language eng "LFP"
#string STR_VIDEO_BT_LFP2                       #language eng "LFP2"
#string STR_VIDEO_BT_EFP                        #language eng "EFP"
#string STR_VIDEO_BT_EFP2                       #language eng "EFP2"
#string STR_VIDEO_BT_EFP3                       #language eng "EFP3"

#string STR_VIDEO_BT_PIPE_B_PROMPT              #language eng "Secondary IGFX Boot Display"
#string STR_VIDEO_BT_PIPE_B_HELP                #language eng "Select Secondary Display Device"
#string STR_VIDEO_BT_PIPE_B_DISABLED            #language eng "Disabled"

#string STR_LFP_COLOR_DEPTH                     #language eng "Panel Color Depth"
#string STR_LFP_COLOR_DEPTH_HELP                #language eng "Select the LFP Panel Color Depth"
#string STR_18BIT_COLOR_DEPTH_STRING            #language eng "18 Bit"
#string STR_24BIT_COLOR_DEPTH_STRING            #language eng "24 Bit"


//----------------------------------------------------------------------------
// Memory Information
//----------------------------------------------------------------------------
#string STR_MEMORY_FORM                 #language eng "Memory Configuration"
#string STR_MEMORY_FORM_HELP            #language eng "Memory Configuration Parameters"

#string STR_MEMORY_INFO                 #language eng "Memory Information"

#string STR_MEMORY_SPEED_NAME           #language eng "Memory Frequency"
#string STR_MEMORY_SPEED_VALUE          #language eng "N/A" // Dynamically updated
#string STR_MEMORY_SPEED_HELP           #language eng "Show Memory Frequency."

#string STR_MEMORY_SIZE_NAME            #language eng "Total Memory"
#string STR_MEMORY_SIZE_VALUE           #language eng "N/A" // Dynamically updated
#string STR_MEMORY_SIZE_HELP            #language eng "Total Memory in the System."

#string STR_MEMORY_VOLTAGE_NAME            #language eng "Memory Voltage"
#string STR_MEMORY_VOLTAGE_VALUE           #language eng "N/A" // Dynamically updated
#string STR_MEMORY_VOLTAGE_HELP            #language eng "Memory Voltage in the System."

#string STR_MEMORY_DIMM_INFO_HELP       #language eng "Memory in the DIMM."

#string STR_MEMORY_DIMM0_NAME           #language eng "DIMM#0"

#string STR_MEMORY_DIMM1_NAME           #language eng "DIMM#1"

#string STR_MEMORY_DIMM2_NAME           #language eng "DIMM#2"

#string STR_MEMORY_DIMM3_NAME           #language eng "DIMM#3"

#string STR_MEMORY_DIMM0_VALUE          #language eng "Not Present"

#string STR_MEMORY_DIMM1_VALUE          #language eng "Not Present"

#string STR_MEMORY_DIMM2_VALUE          #language eng "Not Present"

#string STR_MEMORY_DIMM3_VALUE          #language eng "Not Present"

#string STR_MEMORY_CL_HELP              #language eng "tCL value"
#string STR_MEMORY_CL_NAME              #language eng "CAS Latency (tCL)"
#string STR_MEMORY_CL_VALUE             #language eng "N/A"

#string STR_MEMORY_DELAY_TIME           #language eng "Minimum delay time"

#string STR_MEMORY_TRCD_HELP            #language eng "tRCD value"
#string STR_MEMORY_TRCD_NAME            #language eng "    CAS to RAS (tRCDmin)"
#string STR_MEMORY_OC_TRCD_NAME         #language eng "CAS to RAS (tRCDmin)"
#string STR_MEMORY_TRCD_VALUE           #language eng "N/A"

#string STR_MEMORY_TRP_HELP             #language eng "tRP value"
#string STR_MEMORY_TRP_NAME             #language eng "    Row Precharge (tRPmin)"
#string STR_MEMORY_OC_TRP_NAME          #language eng "Row Precharge (tRPmin)"
#string STR_MEMORY_TRP_VALUE            #language eng "N/A"

#string STR_MEMORY_TRAS_HELP            #language eng "tRAS value"
#string STR_MEMORY_TRAS_NAME            #language eng "    Active to Precharge (tRASmin)"
#string STR_MEMORY_OC_TRAS_NAME         #language eng "Active to Precharge (tRASmin)"
#string STR_MEMORY_TRAS_VALUE           #language eng "N/A"

#string STR_MEMORY_TWR_HELP             #language eng "tWR value"
#string STR_MEMORY_TWR_NAME             #language eng "Write Recovery (tWRmin)"
#string STR_MEMORY_TWR_VALUE            #language eng "N/A"

#string STR_MEMORY_TRFC_HELP            #language eng "tRFC value"
#string STR_MEMORY_TRFC_NAME            #language eng "Refresh Recovery (tRFCmin)"
#string STR_MEMORY_TRFC_VALUE           #language eng "N/A"

#string STR_TREFI_VALUE					#language eng "tREFI value"
#string STR_TREFI_VALUE_HELP		    #language eng "Maximum tREFI Time (Average Periodic Refresh Interval)."

#string STR_TCWL_VALUE					#language eng "tCWL value"
#string STR_TCWL_VALUE_HELP		        #language eng "Minimum CAS Write Latency Time (tCWLmin)."

#string STR_MEMORY_TRRD_HELP            #language eng "tRRD value"
#string STR_MEMORY_TRRD_NAME            #language eng "Row Active to Row Active (tRRDmin)"
#string STR_MEMORY_TRRD_VALUE           #language eng "N/A"

#string STR_MEMORY_TWTR_HELP            #language eng "tWTR value"
#string STR_MEMORY_TWTR_NAME            #language eng "Internal Write to Read Command (tWTRmin)"
#string STR_MEMORY_TWTR_VALUE           #language eng "N/A"

#string STR_MEMORY_TRTP_HELP            #language eng "tRTP value"
#string STR_MEMORY_TRTP_NAME            #language eng "Internal Read to Precharge Command (tRTPmin)"
#string STR_MEMORY_TRTP_VALUE           #language eng "N/A"

#string STR_MEMORY_TRC_HELP             #language eng "tRC value"
#string STR_MEMORY_TRC_NAME             #language eng "Active to Active/Refresh (tRCmin)"
#string STR_MEMORY_TRC_VALUE            #language eng "N/A"

#string STR_MEMORY_TFAW_HELP            #language eng "tFAW value"
#string STR_MEMORY_TFAW_NAME            #language eng "Four Activate Window (tFAWmin)"
#string STR_MEMORY_TFAW_VALUE           #language eng "N/A"

#string STR_MEMORY_TCWL_HELP            #language eng "tCWL value"
#string STR_MEMORY_TCWL_NAME            #language eng "CAS write latency time (tCWL)"
#string STR_MEMORY_TCWL_VALUE           #language eng "N/A"

#string STR_MEMORY_TREFI_HELP            #language eng "tREFI value"
#string STR_MEMORY_TREFI_NAME            #language eng "Average Periodic Refresh Interval(tREFI)"
#string STR_MEMORY_TREFI_VALUE           #language eng "N/A"

#string STR_MEMORY_TRPAB_HELP            #language eng "tRPab value"
#string STR_MEMORY_TRPAB_NAME            #language eng "Row Precharge Delay Time for all banks (tRPab)"
#string STR_MEMORY_TRPAB_VALUE           #language eng "N/A"


#string STR_XMP_PROFILE_PROMPT          #language eng "DIMM profile"
#string STR_XMP_PROFILE_PROMPT_HELP     #language eng "Select DIMM timing profile that should be used."

#string STR_DEFAULT_SPD_PROFILE         #language eng "Default DIMM profile"
#string STR_XMP_PROFILE_1               #language eng "XMP Profile 1"
#string STR_XMP_PROFILE_2               #language eng "XMP Profile 2"
#string STR_CUSTOM_PROFILE              #language eng "Custom Profile"
#string STR_XMP_PROFILE_1_VALUE         #language eng "Not Supported"
#string STR_XMP_PROFILE_2_VALUE         #language eng "Not Supported"


#string STR_MEMORY_OC_FORM              #language eng "Custom Profile Control"
#string STR_MEMORY_OC_FORM_HELP         #language eng "Custom Profile Control Options."
#string STR_MEMORY_OC_TITLE             #language eng "Memory Timing Information"
#string STR_MEMORY_TIMING_SUBTITLE	#language eng "Memory Timing Configuration"

#string STR_NB_MEM_ALIGN                        #language eng "Low MMIO Align"
#string STR_NB_MEM_ALIGN_HELP                   #language eng "Low MMIO resources align at 64MB/1024MB"
#string STR_NB_MEM_ALIGN_64M                    #language eng "64M"
#string STR_NB_MEM_ALIGN_1024M                  #language eng "1024M"
#string STR_PAVPMODE_PROMPT                     #language eng "PAVP Mode"
#string STR_PAVPMODE_HELP                       #language eng "Select PAVP Mode used by Internal Graphics Device"

#string STR_DDR_LV_OPTION_PROMPT                #language eng "DDR Selection"
#string STR_DDR_LV_OPTION_PROMPT_HELP           #language eng "DDR3 or DDR3L Selection."
#string STR_DDR3_STRING                         #language eng "DDR3"
#string STR_DDR3L_STRING                        #language eng "DDR3L"

#string STR_DDR_VOLTAGE_WAIT_TIME_PROMPT        #language eng "DDR Reset Wait Time"
#string STR_DDR_VOLTAGE_WAIT_TIME_PROMPT_HELP   #language eng "The value of ns to wait for switch DDR voltage, minimum 20ns."

#string STR_DDR_FREQ_LIMIT_PROMPT               #language eng "Memory Frequency Limiter"
#string STR_DDR_FREQ_LIMIT_PROMPT_HELP          #language eng "Maximum Memory Frequency Selections in Mhz."
#string STR_DDR3_FREQ_800_STRING                #language eng "800"     // 1
#string STR_DDR3_FREQ_1000_STRING               #language eng "1000"    // 2
#string STR_DDR3_FREQ_1067_STRING               #language eng "1067"    // 3
#string STR_DDR3_FREQ_1200_STRING               #language eng "1200"    // 4
#string STR_DDR3_FREQ_1333_STRING               #language eng "1333"    // 5
#string STR_DDR3_FREQ_1400_STRING               #language eng "1400"    // 6
#string STR_DDR3_FREQ_1600_STRING               #language eng "1600"    // 7
#string STR_DDR3_FREQ_1800_STRING               #language eng "1800"    // 8
#string STR_DDR3_FREQ_1867_STRING               #language eng "1867"    // 9
#string STR_DDR3_FREQ_2000_STRING               #language eng "2000"    // 10
#string STR_DDR3_FREQ_2133_STRING               #language eng "2133"    // 11
#string STR_DDR3_FREQ_2200_STRING               #language eng "2200"    // 12
#string STR_DDR3_FREQ_2400_STRING               #language eng "2400"    // 13
#string STR_DDR3_FREQ_2600_STRING               #language eng "2600"    // 14
#string STR_DDR3_FREQ_2667_STRING               #language eng "2667"    // 15

#string STR_MAX_TOLUD_PROMPT                    #language eng "Max TOLUD"
#string STR_MAX_TOLUD_HELP                      #language eng "Maximum Value of TOLUD. Dynamic assignment would adjust TOLUD automatically based on largest MMIO length of installed graphic controller"
#string STR_MAX_TOLUD_DYNAMIC_STRING            #language eng "Dynamic"
#string STR_MAX_TOLUD_3_5G_STRING               #language eng "3.5 GB"
#string STR_MAX_TOLUD_3_25G_STRING              #language eng "3.25 GB"
#string STR_MAX_TOLUD_3G_STRING                 #language eng "3 GB"
#string STR_MAX_TOLUD_2_75G_STRING              #language eng "2.75 GB"
#string STR_MAX_TOLUD_2_5G_STRING               #language eng "2.5 GB"
#string STR_MAX_TOLUD_2_25G_STRING              #language eng "2.25 GB"
#string STR_MAX_TOLUD_2G_STRING                 #language eng "2 GB"
#string STR_MAX_TOLUD_1_75G_STRING              #language eng "1.75 GB"
#string STR_MAX_TOLUD_1_5G_STRING               #language eng "1.5 GB"
#string STR_MAX_TOLUD_1_25G_STRING              #language eng "1.25 GB"
#string STR_MAX_TOLUD_1G_STRING                 #language eng "1 GB"

#string STR_NMODE_SUPPORT_PROMPT                #language eng "NMode Support"
#string STR_NMODE_SUPPORT_HELP                  #language eng "NMode Support Option."
#string STR_1N_MODE                             #language eng "1N Mode"
#string STR_2N_MODE                             #language eng "2N Mode"

 
#string STR_ECC_SUPPORT_PROMPT                  #language eng "ECC Support"
#string STR_ECC_SUPPORT_HELP                    #language eng "Enable or disable DDR Ecc Support"

#string STR_MEMORY_SCRAMBLER_PROMPT             #language eng "Memory Scrambler"
#string STR_MEMORY_SCRAMBLER_HELP               #language eng "Enable or disable Memory Scrambler support."

#string STR_RMT_CROSSER_ENABLE_PROMPT           #language eng "RMT Crosser Support"
#string STR_RMT_CROSSER_ENABLE_HELP             #language eng "Enable or disable RmtCrosserEnable support."

#string STR_MRC_FAST_BOOT_ENABLE_PROMPT         #language eng "MRC Fast Boot"
#string STR_MRC_FAST_BOOT_ENABLE_HELP           #language eng "Enable or disable MRC fast boot."

#string STR_FORCE_COLD_RESET_ENABLE_PROMPT      #language eng "Force Cold Reset"
#string STR_FORCE_COLD_RESET_ENABLE_HELP        #language eng "Force cold reset or choose MRC cold reset mode, when cold boot is required during MRC execution. Note: If ME 5.0MB is present, Force cold reset is required!"

#string STR_SCRAMBLER_SEED_GENERATION_OFF_PROMPT      #language eng "Scrambler Seed Generation Off"
#string STR_SCRAMBLER_SEED_GENERATION_OFF_HELP        #language eng "Control Memory Scrambler Seed Generation. Enable - do not generation scrambler seed. Disable - Generation scrambler seed always."

#string STR_MEMORY_REMAP_ENABLE_PROMPT          #language eng "Memory Remap"
#string STR_MEMORY_REMAP_ENABLE_HELP            #language eng "Enable or disable memory remap above 4G."

#string STR_CHANNEL_A_DIMM_CONTROL_PROMPT       #language eng "Channel A DIMM Control"
#string STR_CHANNEL_A_DIMM_CONTROL_HELP         #language eng "Enable or disable dimms on channel A."

#string STR_CHANNEL_B_DIMM_CONTROL_PROMPT       #language eng "Channel B DIMM Control"
#string STR_CHANNEL_B_DIMM_CONTROL_HELP         #language eng "Enable or disable dimms on Channel B."

#string STR_ENABLE_BOTH_DIMMS_STRING            #language eng "Enable Both DIMMS"
#string STR_DISABLE_DIMM0_STRING                #language eng "Disable DIMM0"
#string STR_DISABLE_DIMM1_STRING                #language eng "Disable DIMM1"
#string STR_DISABLE_BOTH_DIMMS_STRING           #language eng "Disable Both DIMMS"

#string STR_EXIT_MODE_PROMPT                    #language eng "DIMM Exit Mode"
#string STR_EXIT_MODE_HELP                      #language eng "DIMM Exit Mode Control"
#string STR_SLOW_STRING                         #language eng "Slow Exit"
#string STR_FAST_STRING                         #language eng "Fast Exit"

#string STR_POWER_DOWN_MODE_PROMPT              #language eng "  Power Down Mode"
#string STR_POWER_DOWN_MODE_HELP                #language eng "Power Down Mode Control."
#string STR_NO_PD_STRING                        #language eng "No Power Down"
#string STR_APD_STRING                          #language eng "APD"
#string STR_PPD_STRING                          #language eng "PPD"
#string STR_DLL_OFF_STRING                      #language eng "DLL-off"
#string STR_APD_PPD_STRING                      #language eng "APD-PPD"
#string STR_PPD_DLLOFF_STRING                   #language eng "PPD-DLLoff"

#string STR_PWDWN_DOWN_IDLE_COUNTER_PROMPT      #language eng "DDR PowerDown and idle counter"
#string STR_PWDWN_DOWN_IDLE_COUNTER_HELP        #language eng "BIOS: BIOS is in countrol of DDR CKE mode and idle timer value. PCODE: pcode will manage the modes."
#string STR_BIOS_STRING                         #language eng "BIOS"
#string STR_PCODE_STRING                        #language eng "PCODE"

#string STR_ENHANCED_INTERLEAVE_PROMPT          #language eng "Enh Interleave Support"
#string STR_ENHANCED_INTERLEAVE_HELP            #language eng "Enable or disable Enhanced Interleave support."
#string STR_RANK_INTERLEAVE_PROMPT              #language eng "RI Support"
#string STR_RANK_INTERLEAVE_HELP                #language eng "Enable or disable Rank Interleave support. NOTE: RI and HORI can not be enabled at the same time."
#string STR_WEAK_LOCK_ENABLE_PROMPT             #language eng "DLL Weak Lock Support"
#string STR_WEAK_LOCK_ENABLE_HELP               #language eng "Enable or disable Dll Weak lock support."
#string STR_MC_LOCK_PROMPT                      #language eng "Mc Lock"
#string STR_MC_LOCK_HELP                        #language eng "Enable or disable capacity to lock or not MC registers."
#string STR_CH_HASH_SUPPORT_PROMPT              #language eng "Ch Hash Support"                
#string STR_CH_HASH_SUPPORT_HELP                #language eng "Enable or disable Channel Hash Support. NOTE: ONLY if Memory interleaved Mode."
#string STR_CH_HASH_MASK_PROMPT                 #language eng "Ch Hash Mask"                
#string STR_CH_HASH_MASK_HELP                   #language eng "Set the BIT(s) to be included in the XOR function. NOTE: BIT mask corresponds to BITS[19:6]"
#string STR_CH_HASH_INTERLEAVED_BIT_PROMPT      #language eng "Ch Hash Interleaved Bit"                
#string STR_CH_HASH_INTERLEAVED_BIT_HELP        #language eng "Select the BIT to be used for Channel Interleaved mode. NOTE: BIT7 will interlave the channels at a 2 cacheline granularity, BIT8 at 4 and BIT9 at 8."
#string STR_GDXCENABLE_PROMPT                   #language eng "GDXC Support"
#string STR_GDXCENABLE_HELP                     #language eng "Enable or disable GDXC"

//----------------------------------------------------------------------------
// Memory Thermal Configuration
//----------------------------------------------------------------------------
#string STR_USER_POWER_WEIGHTS_ENABLE_TITLE  #language eng "Use user provided power weights,"
#string STR_USER_POWER_WEIGHTS_ENABLE_TITLE1 #language eng "scalue factor, and channel power floor values." 
#string STR_USER_POWER_WEIGHTS_ENABLE_PROMPT #language eng "User Power Weights Enable"                
#string STR_USER_POWER_WEIGHTS_ENABLE_HELP   #language eng "Enable: User provided power weights, scalue factor, and channel power floor values are used. Disable: BIOS sets power weights, scalue factor, and channel power floor values based on DIMMs present in system."

#string STR_ENERGY_SCALE_FACT_PROMPT         #language eng "Energy Scale Fact"                
#string STR_ENERGY_SCALE_FACT_HELP           #language eng "Range [7;0]= [7.3;931.3]] in pJ."

#string STR_IDLE_ENERGY_CH0DIMM0_PROMPT      #language eng "Idle Energy Ch0Dimm0" 
#string STR_IDLE_ENERGY_CH0DIMM1_PROMPT      #language eng "Idle Energy Ch0Dimm1" 
#string STR_IDLE_ENERGY_CH1DIMM0_PROMPT      #language eng "Idle Energy Ch1Dimm0" 
#string STR_IDLE_ENERGY_CH1DIMM1_PROMPT      #language eng "Idle Energy Ch1Dimm1"                
#string STR_IDLE_ENERGY_CHXDIMMX_HELP        #language eng "Idle Energy Consumed for 1 clk w/dimm idle/cke on, range[63;0]."

#string STR_PD_ENERGY_CH0DIMM0_PROMPT        #language eng "PowerDown Energy Ch0Dimm0" 
#string STR_PD_ENERGY_CH0DIMM1_PROMPT        #language eng "PowerDown Energy Ch0Dimm1"  
#string STR_PD_ENERGY_CH1DIMM0_PROMPT        #language eng "PowerDown Energy Ch1Dimm0" 
#string STR_PD_ENERGY_CH1DIMM1_PROMPT        #language eng "PowerDown Energy Ch1Dimm1"               
#string STR_PD_ENERGY_CHXDIMMX_HELP          #language eng "PowerDown Energy Consumed w/dimm idle/cke off, range[63;0]."

#string STR_ACT_ENERGY_CH0DIMM0_PROMPT        #language eng "Activate Energy Ch0Dimm0" 
#string STR_ACT_ENERGY_CH0DIMM1_PROMPT        #language eng "Activate Energy Ch0Dimm1"  
#string STR_ACT_ENERGY_CH1DIMM0_PROMPT        #language eng "Activate Energy Ch1Dimm0" 
#string STR_ACT_ENERGY_CH1DIMM1_PROMPT        #language eng "Activate Energy Ch1Dimm1"               
#string STR_ACT_ENERGY_CHXDIMMX_HELP          #language eng "Activate Energy Contribution, range[255;0]."

#string STR_RD_ENERGY_CH0DIMM0_PROMPT        #language eng "Read Energy Ch0Dimm0" 
#string STR_RD_ENERGY_CH0DIMM1_PROMPT        #language eng "Read Energy Ch0Dimm1"  
#string STR_RD_ENERGY_CH1DIMM0_PROMPT        #language eng "Read Energy Ch1Dimm0" 
#string STR_RD_ENERGY_CH1DIMM1_PROMPT        #language eng "Read Energy Ch1Dimm1"              
#string STR_RD_ENERGY_CHXDIMMX_HELP          #language eng "Read Energy Contribution, range[255;0]."

#string STR_WR_ENERGY_CH0DIMM0_PROMPT        #language eng "Write Energy Ch0Dimm0" 
#string STR_WR_ENERGY_CH0DIMM1_PROMPT        #language eng "Write Energy Ch0Dimm1"   
#string STR_WR_ENERGY_CH1DIMM0_PROMPT        #language eng "Write Energy Ch1Dimm0" 
#string STR_WR_ENERGY_CH1DIMM1_PROMPT        #language eng "Write Energy Ch1Dimm1"            
#string STR_WR_ENERGY_CHXDIMMX_HELP          #language eng "Write Energy Contribution, range[255;0]."

#string STR_LOCK_PTM_REG_PROMPT              #language eng "Lock Thermal Management Registers"                
#string STR_LOCK_PTM_REG_HELP                #language eng "Enable or disable Lock several PCU registers related to DDR power Thermal Management."

#string STR_REFRESH_2X_PROMPT                 #language eng "Refresh 2x Support"
#string STR_REFRESH_2X_HELP                   #language eng "Enable or disable Refresh 2x support."
#string STR_REFRESH_2X_MODE_PROMPT            #language eng "  Refresh 2x Mode"
#string STR_REFRESH_2X_MODE_HELP              #language eng "Select 2x Refresh mode."
#string STR_REFRESH_2X_ALWAYS                 #language eng "Always"
#string STR_REFRESH_2X_HOT                    #language eng "Hot only"

#string STR_LPDDR_THERMAL_SENSOR_PROMPT       #language eng "LPDDR Thermal Sensor"                
#string STR_LPDDR_THERMAL_SENSOR_HELP         #language eng "When enabled, MC uses MR4 to read LPDDR thermal sensors."

#string STR_SREF_CFG_ENA_PROMPT               #language eng "SelfRefresh Enable"                
#string STR_SREF_CFG_ENA_HELP                 #language eng "Enable or disable(Enable =Def)."

#string STR_SREF_CFG_IDLE_TMR_PROMPT          #language eng "SelfRefresh IdleTimer"                
#string STR_SREF_CFG_IDLE_TMR_HELP            #language eng "Range [64K-1;512] in DLCK800s, (512= Def)."

#string STR_THRT_CKE_MIN_DEFEAT_PROMPT        #language eng "Throttler CKEMin Defeature"                
#string STR_THRT_CKE_MIN_DEFEAT_HELP          #language eng "On or Off(Off =Def)."

#string STR_THROTTLER_CKEMIN_TIMER_PROMPT          #language eng "Throttler CKEMin Timer"                
#string STR_THROTTLER_CKEMIN_TIMER_HELP            #language eng "Timer value for CKEMin, range[255;0] . Reqd min of SC_ROUND_T + BYTE_LENGTH (4)."

#string STR_THRT_CKE_MIN_DEFEAT_LPDDR_PROMPT        #language eng "Throttler CKEMin Defeature For LPDDR"                
#string STR_THRT_CKE_MIN_DEFEAT_LPDDR_HELP          #language eng "For LPDDR Only: On or Off."

#string STR_THROTTLER_CKEMIN_TIMER_LPDDR_PROMPT     #language eng "Throttler CKEMin Timer For LPDDR"                
#string STR_THROTTLER_CKEMIN_TIMER_LPDDR_HELP       #language eng "For LPDDR Only: Timer value for CKEMin, range[255;0]. Reqd min of SC_ROUND_T + BYTE_LENGTH (4)."

#string STR_ENABLE_POWER_DOWN_LPDDR_PROMPT        #language eng "DDR PowerDown and idle counter For LPDDR"                
#string STR_ENABLE_POWER_DOWN_LPDDR_HELP          #language eng "For LPDDR Only: BIOS: BIOS is in control of DDR CKE mode and idle timer value. PCODE: pcode will manage the modes."

#string STR_RAPL_POWER_FLOOR_CH0_PROMPT             #language eng "RAPL Power Floor Ch0"                
#string STR_RAPL_POWER_FLOOR_CH1_PROMPT             #language eng "RAPL Power Floor Ch1"                
#string STR_RAPL_POWER_FLOOR_CHX_HELP               #language eng "Power budget, range[255;0], (0= 5.3W Def)"

#string STR_RAPL_LIM2_LOCK_PROMPT                   #language eng "RAPL PL Lock"                
#string STR_RAPL_LIM2_LOCK_HELP                     #language eng "Enable or disable lock Rapl Limit register."

#string STR_RAPL_LIM1_ENA_PROMPT                   #language eng "RAPL PL 1 Enable"                
#string STR_RAPL_LIM1_ENA_HELP                     #language eng "Enable or disable RAPL PL 1."
#string STR_RAPL_LIM1_PWR_PROMPT                   #language eng "RAPL PL 1 Power"
#string STR_RAPL_LIM1_WINDOWX_PROMPT               #language eng "RAPL PL 1 WindowX"
#string STR_RAPL_LIM1_WINDOWY_PROMPT               #language eng "RAPL PL 1 WindowY"             
#string STR_RAPL_LIM2_ENA_PROMPT                   #language eng "RAPL PL 2 Enable"                
#string STR_RAPL_LIM2_ENA_HELP                     #language eng "Enable or disable RAPL PL 2."
#string STR_RAPL_LIM2_PWR_PROMPT                   #language eng "RAPL PL 2 Power"
#string STR_RAPL_LIM2_WINDOWX_PROMPT               #language eng "RAPL PL 2 WindowX"
#string STR_RAPL_LIM2_WINDOWY_PROMPT               #language eng "RAPL PL 2 WindowY"               
#string STR_RAPL_LIM_PWR_HELP                      #language eng "Range[0;2^14-1]= [2047.875;0] in W."
#string STR_RAPL_LIM1_WINDOWX_HELP                 #language eng "Power PL 1 time window X value, (1/1024)*(1+(x/4))*(2^y)(0=Def)"
#string STR_RAPL_LIM2_WINDOWX_HELP                 #language eng "Power PL 2 time window X value, (1/1024)*(1+(x/4))*(2^y)(0=Def)"
#string STR_RAPL_LIM1_WINDOWY_HELP                 #language eng "Power PL 1 time window Y value, (1/1024)*(1+(x/4))*(2^y)(0=Def)"
#string STR_RAPL_LIM2_WINDOWY_HELP                 #language eng "Power PL 2 time window Y value, (1/1024)*(1+(x/4))*(2^y)(0=Def)"


#string STR_ENABLE_EXTERN_STATUS_PROMPT         #language eng "Extern Therm Status"                
#string STR_ENABLE_EXTERN_STATUS_HELP           #language eng "Enable: The value from EXTTS is used, Disabled: Pcode ignores the EXTTS."
#string STR_ENABLE_CLTM_PROMPT                  #language eng "Closed Loop Therm Manage"                
#string STR_ENABLE_CLTM_HELP                    #language eng "Enable: CLTM pcode algorithm will be used. Note: CLTM will preceed OLTM."
#string STR_ENABLE_OLTM_PROMPT                  #language eng "Open Loop Therm Manage"                
#string STR_ENABLE_OLTM_HELP                    #language eng "Enable: OLTM pcode algorithm will be used. Note: CLTM will preceed OLTM."

#string STR_WARM_THRESHOLD_CH0DIMM0_PROMPT      #language eng "Warm Threshold Ch0 Dimm0"
#string STR_WARM_THRESHOLD_CH0DIMM1_PROMPT      #language eng "Warm Threshold Ch0 Dimm1"  
#string STR_HOT_THRESHOLD_CH0DIMM0_PROMPT      #language eng "Hot Threshold Ch0 Dimm0" 
#string STR_HOT_THRESHOLD_CH0DIMM1_PROMPT      #language eng "Hot Threshold Ch0 Dimm1"  
#string STR_WARM_THRESHOLD_CH1DIMM0_PROMPT      #language eng "Warm Threshold Ch1 Dimm0"
#string STR_WARM_THRESHOLD_CH1DIMM1_PROMPT      #language eng "Warm Threshold Ch1 Dimm1"  
#string STR_HOT_THRESHOLD_CH1DIMM0_PROMPT      #language eng "Hot Threshold Ch1 Dimm0" 
#string STR_HOT_THRESHOLD_CH1DIMM1_PROMPT      #language eng "Hot Threshold Ch1 Dimm1"  

#string STR_WARM_BUDGET_CH0DIMM0_PROMPT      #language eng "Warm Budget Ch0 Dimm0"
#string STR_WARM_BUDGET_CH0DIMM1_PROMPT      #language eng "Warm Budget Ch0 Dimm1"
#string STR_HOT_BUDGET_CH0DIMM0_PROMPT      #language eng "Hot Budget Ch0 Dimm0"
#string STR_HOT_BUDGET_CH0DIMM1_PROMPT      #language eng "Hot Budget Ch0 Dimm1"
#string STR_WARM_BUDGET_CH1DIMM0_PROMPT      #language eng "Warm Budget Ch1 Dimm0"
#string STR_WARM_BUDGET_CH1DIMM1_PROMPT      #language eng "Warm Budget Ch1 Dimm1"
#string STR_HOT_BUDGET_CH1DIMM0_PROMPT      #language eng "Hot Budget Ch1 Dimm0"
#string STR_HOT_BUDGET_CH1DIMM1_PROMPT      #language eng "Hot Budget Ch1 Dimm1"
              
#string STR_THRESHOLD_AND_BUDGET_CHXDIMMX_HELP        #language eng "Range[0;255]=[0;31.875] in W, (255= 31.875W= Def)"

#string STR_DRAM_POWER_METER_FORM_TITLE    #language eng "Dram Power Meter"
#string STR_DRAM_POWER_METER_FORM_HELP     #language eng "Dram Power Meter Options"

#string STR_MEMORY_THERMAL_REPORTING_FORM_TITLE    #language eng "Memory Thermal Reporting"
#string STR_MEMORY_THERMAL_REPORTING_FORM_HELP     #language eng "Memory Thermal Reporting Options"

#string STR_THERMAL_THRESHOLD_SETTINGS_FORM_TITLE    #language eng "Thermal Threshold Settings"
#string STR_THERMAL_THROTTLE_BUDGET_SETTINGS_FORM_TITLE    #language eng "Thermal Throttle Budget Settings"

#string STR_MEMORY_POWER_AND_THERMAL_THROTTLING_FORM_TITLE    #language eng "Memory Power and Thermal Throttling"
#string STR_MEMORY_POWER_AND_THERMAL_THROTTLING_FORM_HELP     #language eng "Memory Power and Thermal Throttling Options"

#string STR_MEMORY_RAPL_FORM_TITLE    #language eng "Memory RAPL"
#string STR_MEMORY_RAPL_FORM_HELP     #language eng "Memory RAPL Options"

#string STR_MEMORY_THERMAL_CONFIG_FORM_TITLE    #language eng "Memory Thermal Configuration"
#string STR_MEMORY_THERMAL_CONFIG_FORM_HELP     #language eng "Memory Thermal Configuration Options"

#string STR_MEMORY_THERMAL_CONFIGURATION        #language eng "Memory Thermal Configuration"
#string STR_MEMORY_THERMAL_MANAGEMENT_PROMPT    #language eng "Memory Thermal Management"
#string STR_MEMORY_THERMAL_MANAGEMENT_HELP      #language eng "Enable or disable Memory Thermal Management."
#string STR_PECI_INJECTED_TEMPERATURE_PROMPT    #language eng "PECI Injected Temperature"                
#string STR_PECI_INJECTED_TEMPERATURE_HELP      #language eng "Enable or disable memory temperatures to be injected to the processor via PECI."
#string STR_EXTTS_OVER_TS_ON_BOARD_PROMPT       #language eng "EXTTS# via TS-on-Board"                
#string STR_EXTTS_OVER_TS_ON_BOARD_HELP         #language eng "Enable or disable routing TS-on-Board’s ALERT# and THERM# to EXTTS# pins on the PCH."
#string STR_EXTTS_OVER_TS_ON_DIMM_PROMPT        #language eng "EXTTS# via TS-on-DIMM"                
#string STR_EXTTS_OVER_TS_ON_DIMM_HELP          #language eng "Enable or disable routing TS-on-DIMM’s ALERT# to EXTTS# pin on the PCH."
#string STR_VIRTUAL_TEMP_SENSOR_PROMPT          #language eng "Virtual Temperature Sensor (VTS)"                
#string STR_VIRTUAL_TEMP_SENSOR_HELP            #language eng "Enable or disable Virtual Temperature Sensor (VTS)."

//----------------------------------------------------------------------------
// PCI Express Root Port Configuration
//----------------------------------------------------------------------------

#string STR_PCIE_CONFIGURATION_FORM     #language eng "NB PCIe Configuration "
#string STR_PCIE_CONFIGURATION_HELP     #language eng "Config NB PCI Express Settings."

#string STR_NBRPINTPIN_PROMPT           #language eng "PCI-E Bridge INT Pin"
#string STR_NBRPINTPIN_HELP             #language eng "Enable or disable PCI Express Root Port Interrupt Pin."

#string STR_HOT_RESET_PROMPT            #language eng "PCI-E Hot Reset"
#string STR_HOT_RESET_HELP              #language eng "Enable or disable PCI Express Hot Reset."

#string STR_MULTI_ADAPTER_PROMPT        #language eng "PCI-E Multi-Adapter"
#string STR_MULTI_ADAPTER_HELP          #language eng "Enable or disable PCI Express Multi-Adaptert Supported."

#string STR_POWER_SAVING_PROMPT         #language eng "PCI-E Power Saving"
#string STR_POWER_SAVING_HELP           #language eng "Enable or disable PCI Express Power Saving."

#string STR_VIDEO_BRIDGE_PROMPT         #language eng "Video Bridge (307)"
#string STR_VIDEO_BRIDGE_HELP           #language eng "Enable or disable Video Bridge (307) Function."

#string STR_PRIMARY_PEG                         #language eng " Primary PEG"
#string STR_PRIMARY_PEG_HELP                    #language eng "Select Auto/PEG1/PEG2 Graphics device should be Primary PEG."

#string STR_PRIMARY_PCIE                         #language eng " Primary PCIE"
#string STR_PRIMARY_PCIE_HELP                    #language eng "Select Auto/PCIE1/PCIE2/PCIE3/PCIE4/PCIE5/PCIE6/PCIE7 Graphics device should be Primary PCIE."

#string STR_PEG0_GENX_SUPPORT_PROMPT            #language eng "  PEG0 - Gen X"
#string STR_PEG0_GENX_SUPPORT_HELP              #language eng "Configure PEG0 B0:D1:F0 Gen1-Gen3"

#string STR_PEG1_GENX_SUPPORT_PROMPT            #language eng "  PEG1 - Gen X"
#string STR_PEG1_GENX_SUPPORT_HELP              #language eng "Configure PEG1 B0:D1:F1 Gen1-Gen3"

#string STR_PEG2_GENX_SUPPORT_PROMPT            #language eng "  PEG2 - Gen X"
#string STR_PEG2_GENX_SUPPORT_HELP              #language eng "Configure PEG2 B0:D1:F2 Gen1-Gen3"

#string STR_PCIE0_DE_EMPHASIS_PROMPT            #language eng "PEG0 De-emphasis Control"
#string STR_PCIE0_DE_EMPHASIS_HELP              #language eng "PEG0:Configure the De-emphasis control on PEG"
#string STR_PCIE1_DE_EMPHASIS_PROMPT            #language eng "PEG1 De-emphasis Control"
#string STR_PCIE1_DE_EMPHASIS_HELP              #language eng "PEG1:Configure the De-emphasis control on PEG"
#string STR_PCIE2_DE_EMPHASIS_PROMPT            #language eng "PEG2 De-emphasis Control"
#string STR_PCIE2_DE_EMPHASIS_HELP              #language eng "PEG2:Configure the De-emphasis control on PEG"
#string STR_6DB_STRING                          #language eng "-6 dB"
#string STR_35DB_STRING                         #language eng "-3.5 dB"

#string STR_PEG0_ASPM_PROMPT                    #language eng "PEG0 - ASPM"
#string STR_PEG1_ASPM_PROMPT                    #language eng "PEG1 - ASPM"
#string STR_PEG2_ASPM_PROMPT                    #language eng "PEG2 - ASPM"
#string STR_PEG_ASPM_HELP                       #language eng "Control ASPM support for the PEG Device.  This has no effect if PEG is not the currently active device."
#string STR_PCIE_ASPM_L0S_PROMPT                #language eng "ASPM L0s"
#string STR_PCIE_ASPM_L0S_HELP                  #language eng "Enable PCIe ASPM L0s."
#string STR_PCIE_ASPM_L1_PROMPT                 #language eng "ASPM L1"
#string STR_PCIE_ASPM_L1_HELP                   #language eng "Enable PCIe ASPM L1."
#string STR_PCIE_ASPM_L0SL1_PROMPT              #language eng "ASPM L0sL1"
#string STR_PCIE_ASPM_L0SL1_HELP                #language eng "Enable ASPM L0sL1."

#string STR_C7_ALLOWED_PROMPT                   #language eng "Run-time C7 Allowed"
#string STR_C7_ALLOWED_HELP                     #language eng "Enable/Disable the entry to C7 state [Run-time controll]. Don't enable this feature until you have all the approiate Save/Restore Controller/Endpoint state."

#string STR_ALWAYS_ENABLE_PEG_PROMPT            #language eng "Enable PEG"
#string STR_ALWAYS_ENABLE_PEG_HELP              #language eng "To enable or disable the PEG."

#string STR_PCIE_ASPM_EN_PROMPT                 #language eng "  ASPM"
#string STR_PCIE_ASPM_EN_HELP                   #language eng "Enable PCI Express Active State Power Management settings."
#string STR_PCIE_ASPM_PROMPT                    #language eng "Automatic ASPM"
#string STR_PCIE_ASPM_HELP                      #language eng "Automatically enable ASPM based on reported capabilities and known issues."
#string STR_PCIE_ASPM_L0S_PROMPT                #language eng "ASPM L0s"
#string STR_PCIE_ASPM_L0S_HELP                  #language eng "Enable PCIe ASPM L0s."
#string STR_PCIE_ASPM_L0S_RP_STRING             #language eng "Root Port Only"
#string STR_PCIE_ASPM_L0S_EP_STRING             #language eng "Endpoint Port Only"
#string STR_PCIE_ASPM_L0S_BOTH_STRING           #language eng "Both Root and Endpoint Ports"

#string STR_PCIE_GEN3_EQUALIZATION_PROMPT      #language eng "PEG Gen3 Equalization"
#string STR_PCIE_GEN3_EQUALIZATION_HELP        #language eng "Perform PEG Gen3 Equalization steps"

#string STR_PCIE_GEN3_ROOT_PORT_PRESET_VALUE_FORM    #language eng " PEG Gen3 Root Port Preset Value for each Lane"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_VALUE_HELP    #language eng "Root Port Preset Value Per lane for Gen3 Equalization."

#string STR_PCIE_GEN3_END_POINT_PRESET_VALUE_FORM    #language eng " PEG Gen3 Endpoint Preset Value each Lane"
#string STR_PCIE_GEN3_END_POINT_PRESET_VALUE_HELP    #language eng "Endpoint Preset Value Per lane for Gen3 Equalization."

#string STR_PCIE_GEN3_END_POINT_HINT_VALUE_FORM      #language eng " PEG Gen3 Endpoint Hint Value each Lane"
#string STR_PCIE_GEN3_END_POINT_HINT_VALUE_HELP      #language eng "Endpoint Hint Value Per lane for Gen3 Equalization."

#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE00_PROMPT #language eng "Gen3 Root Port Preset Lane 0"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE00_HELP   #language eng "Lane 0 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE01_PROMPT #language eng "Gen3 Root Port Preset Lane 1"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE01_HELP   #language eng "Lane 1 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE02_PROMPT #language eng "Gen3 Root Port Preset Lane 2"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE02_HELP   #language eng "Lane 2 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE03_PROMPT #language eng "Gen3 Root Port Preset Lane 3"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE03_HELP   #language eng "Lane 3 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE04_PROMPT #language eng "Gen3 Root Port Preset Lane 4"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE04_HELP   #language eng "Lane 4 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE05_PROMPT #language eng "Gen3 Root Port Preset Lane 5"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE05_HELP   #language eng "Lane 5 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE06_PROMPT #language eng "Gen3 Root Port Preset Lane 6"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE06_HELP   #language eng "Lane 6 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE07_PROMPT #language eng "Gen3 Root Port Preset Lane 7"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE07_HELP   #language eng "Lane 7 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE08_PROMPT #language eng "Gen3 Root Port Preset Lane 8"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE08_HELP   #language eng "Lane 8 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE09_PROMPT #language eng "Gen3 Root Port Preset Lane 9"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE09_HELP   #language eng "Lane 9 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE10_PROMPT #language eng "Gen3 Root Port Preset Lane 10"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE10_HELP   #language eng "Lane 10 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE11_PROMPT #language eng "Gen3 Root Port Preset Lane 11"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE11_HELP   #language eng "Lane 11 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE12_PROMPT #language eng "Gen3 Root Port Preset Lane 12"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE12_HELP   #language eng "Lane 12 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE13_PROMPT #language eng "Gen3 Root Port Preset Lane 13"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE13_HELP   #language eng "Lane 13 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE14_PROMPT #language eng "Gen3 Root Port Preset Lane 14"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE14_HELP   #language eng "Lane 14 Root port preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE15_PROMPT #language eng "Gen3 Root Port Preset Lane 15"
#string STR_PCIE_GEN3_ROOT_PORT_PRESET_LANE15_HELP   #language eng "Lane 15 Root port preset value for Gen3 Equalization."

#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE00_PROMPT  #language eng "Gen3 End point Preset Lane 0"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE00_HELP    #language eng "Lane 0 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE01_PROMPT  #language eng "Gen3 End point Preset Lane 1"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE01_HELP    #language eng "Lane 1 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE02_PROMPT  #language eng "Gen3 End point Preset Lane 2"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE02_HELP    #language eng "Lane 2 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE03_PROMPT  #language eng "Gen3 End point Preset Lane 3"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE03_HELP    #language eng "Lane 3 Endpoint preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE04_PROMPT  #language eng "Gen3 End point Preset Lane 4"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE04_HELP    #language eng "Lane 4 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE05_PROMPT  #language eng "Gen3 End point Preset Lane 5"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE05_HELP    #language eng "Lane 5 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE06_PROMPT  #language eng "Gen3 End point Preset Lane 6"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE06_HELP    #language eng "Lane 6 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE07_PROMPT  #language eng "Gen3 End point Preset Lane 7"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE07_HELP    #language eng "Lane 7 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE08_PROMPT  #language eng "Gen3 End point Preset Lane 8"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE08_HELP    #language eng "Lane 8 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE09_PROMPT  #language eng "Gen3 End point Preset Lane 9"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE09_HELP    #language eng "Lane 9 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE10_PROMPT  #language eng "Gen3 End point Preset Lane 10"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE10_HELP    #language eng "Lane 10 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE11_PROMPT  #language eng "Gen3 End point Preset Lane 11"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE11_HELP    #language eng "Lane 11 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE12_PROMPT  #language eng "Gen3 End point Preset Lane 12"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE12_HELP    #language eng "Lane 12 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE13_PROMPT  #language eng "Gen3 End point Preset Lane 13"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE13_HELP    #language eng "Lane 13 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE14_PROMPT  #language eng "Gen3 End point Preset Lane 14"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE14_HELP    #language eng "Lane 14 End point preset value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE15_PROMPT  #language eng "Gen3 End point Preset Lane 15"
#string STR_PCIE_GEN3_ENDPOINT_PRESET_LANE15_HELP    #language eng "Lane 15 End point preset value for Gen3 Equalization."

#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE00_PROMPT    #language eng "Gen3 End point Hint Lane 0"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE00_HELP      #language eng "Lane 0 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE01_PROMPT    #language eng "Gen3 End point Hint Lane 1"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE01_HELP      #language eng "Lane 1 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE02_PROMPT    #language eng "Gen3 End point Hint Lane 2"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE02_HELP      #language eng "Lane 2 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE03_PROMPT    #language eng "Gen3 End point Hint Lane 3"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE03_HELP      #language eng "Lane 3 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE04_PROMPT    #language eng "Gen3 End point Hint Lane 4"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE04_HELP      #language eng "Lane 4 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE05_PROMPT    #language eng "Gen3 End point Hint Lane 5"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE05_HELP      #language eng "Lane 5 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE06_PROMPT    #language eng "Gen3 End point Hint Lane 6"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE06_HELP      #language eng "Lane 6 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE07_PROMPT    #language eng "Gen3 End point Hint Lane 7"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE07_HELP      #language eng "Lane 7 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE08_PROMPT    #language eng "Gen3 End point Hint Lane 8"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE08_HELP      #language eng "Lane 8 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE09_PROMPT    #language eng "Gen3 End point Hint Lane 9"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE09_HELP      #language eng "Lane 9 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE10_PROMPT    #language eng "Gen3 End point Hint Lane 10"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE10_HELP      #language eng "Lane 10 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE11_PROMPT    #language eng "Gen3 End point Hint Lane 11"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE11_HELP      #language eng "Lane 11 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE12_PROMPT    #language eng "Gen3 End point Hint Lane 12"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE12_HELP      #language eng "Lane 12 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE13_PROMPT    #language eng "Gen3 End point Hint Lane 13"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE13_HELP      #language eng "Lane 13 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE14_PROMPT    #language eng "Gen3 End point Hint Lane 14"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE14_HELP      #language eng "Lane 14 End point Hint value for Gen3 Equalization."
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE15_PROMPT    #language eng "Gen3 End point Hint Lane 15"
#string STR_PCIE_GEN3_ENDPOINT_HINT_LANE15_HELP      #language eng "Lane 15 End point Hint value for Gen3 Equalization."

#string STR_PCIE_GEN3_EQ_PHASE2_PROMPT               #language eng " Gen3 Eq Phase 2"
#string STR_PCIE_GEN3_EQ_PHASE2_HELP                 #language eng "Perform PEG Gen3 Equalization Phase 2"

#string STR_PCIE_SAMPLER_CALIBRATE_PROMPT       #language eng "PEG Sampler Calibrate"
#string STR_PCIE_SAMPLER_CALIBRATE_HELP         #language eng "Enable or disable PEG Sampler Calibrate\nAuto means Disabled for SNB MB/DT, Enabled for IVB A0 B0."

#string STR_PCIE_GEN3_EQ_PRESET_SEARCH_PROMPT   #language eng " Gen3 Eq Preset Search"
#string STR_PCIE_GEN3_EQ_PRESET_SEARCH_HELP     #language eng "Perform PEG Gen3 Preset Search algorithm, on IVB C0 and Later."

#string STR_PCIE_GEN3_EQ_PRESET_RESEARCH_PROMPT #language eng "  Always re-search Gen3 Eq Preset"
#string STR_PCIE_GEN3_EQ_PRESET_RESEARCH_HELP   #language eng "Always re-search Gen3 Preset, even it has been done once."

#string STR_PRESET_SEARCH_DWELL_TIME_PROMPT     #language eng "  Preset Search Dwell Time"
#string STR_PRESET_SEARCH_DWELL_TIME_HELP       #language eng "PEG Gen3 Preset Search Dwell Time in [ms]."

#string STR_SEARCH_MARGIN_STEPS_PROMPT          #language eng "  Timing Margin Steps"
#string STR_SEARCH_MARGIN_STEPS_HELP            #language eng "Number of margin steps during Preset Search, [1..255]."

#string STR_SEARCH_START_MARGIN_PROMPT          #language eng "  Timing Start Margin"
#string STR_SEARCH_START_MARGIN_HELP            #language eng "The starting value for the backward margin search, [4..255]."

#string STR_VOLTAGE_SEARCH_MARGIN_STEPS_PROMPT  #language eng "  Voltage Margin Steps"
#string STR_VOLTAGE_SEARCH_MARGIN_STEPS_HELP    #language eng "Number of margin steps [1..255] during Preset Search."

#string STR_VOLTAGE_SEARCH_START_MARGIN_PROMPT  #language eng "  Voltage Start Margin"
#string STR_VOLTAGE_SEARCH_START_MARGIN_HELP    #language eng "The starting value [4..255] for the backward margin search."

#string STR_FAVOR_TIMING_MARGIN_PROMPT          #language eng "  Favor Timing Margin"
#string STR_FAVOR_TIMING_MARGIN_HELP             #language eng "If enabled, preset search should pick Timing Margin in case of a tie with Voltage Margin."

#string STR_ERROR_TARGET_MARGIN_PROMPT          #language eng "  Error Target"
#string STR_ERROR_TARGET_MARGIN_HELP            #language eng "The margin search error target value [1..65535]."

#string STR_PCIE_SWING_CONTROL_PROMPT           #language eng "Swing Control"
#string STR_PCIE_SWING_CONTROL_HELP             #language eng "Perform PEG Swing Control, on IVB C0 and Later."
#string STR_COMMON_REDUCED                      #language eng "Reduced"
#string STR_COMMON_HALF                         #language eng "Half"
#string STR_COMMON_FULL                         #language eng "Full"

#string STR_PEG0_INFO_HELP                      #language eng "PEG0 Link and Speed Information"
#string STR_PEG0_INFO_NAME                      #language eng "PEG0"
#string STR_PEG0_INFO_VALUE                     #language eng "Not Present"

#string STR_PEG1_INFO_HELP                      #language eng "PEG1 Link and Speed Information"
#string STR_PEG1_INFO_NAME                      #language eng "PEG1"
#string STR_PEG1_INFO_VALUE                     #language eng "Not Present"

#string STR_PEG2_INFO_HELP                      #language eng "PEG2 Link and Speed Information"
#string STR_PEG2_INFO_NAME                      #language eng "PEG2"
#string STR_PEG2_INFO_VALUE                     #language eng "Not Present"

#string STR_PEG_RXCEM_LOOPBACK_MODE_PROMPT      #language eng "PEG RxCEM LoopBack Mode"
#string STR_PEG_RXCEM_LOOPBACK_MODE_HELP        #language eng "Enabled/Disabled PEG RxCEM Loopback Mode"
#string STR_PEG_LANE_NO_TEST_PROMPT             #language eng "  PEG Lane numbar for Test"
#string STR_PEG_LANE_NO_TEST_HELP               #language eng "PEG Lane number for RxCEM Loopback mode (0~15)"


#string STR_PCIE_GEN3_RXCTLEP_PROMPT            #language eng "PCIe Gen3 RxCTLEp Setting"
#string STR_PCIE_GEN3_RXCTLEP_HELP              #language eng "The range of the setting is (0~15) This setting has to be specified basing on platform design and following the guideline."

#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE00_PROMPT  #language eng "PCIe Gen3 RxCTLEp Setting 0"
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE01_PROMPT  #language eng "PCIe Gen3 RxCTLEp Setting 1"
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE02_PROMPT  #language eng "PCIe Gen3 RxCTLEp Setting 2"
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE03_PROMPT  #language eng "PCIe Gen3 RxCTLEp Setting 3"
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE04_PROMPT  #language eng "PCIe Gen3 RxCTLEp Setting 4"
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE05_PROMPT  #language eng "PCIe Gen3 RxCTLEp Setting 5"
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE06_PROMPT  #language eng "PCIe Gen3 RxCTLEp Setting 6"
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE07_PROMPT  #language eng "PCIe Gen3 RxCTLEp Setting 7"

#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE00_HELP    #language eng "The range of the setting is (0~15) This setting has to be specified basing on platform design and following the guideline."
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE01_HELP    #language eng "The range of the setting is (0~15) This setting has to be specified basing on platform design and following the guideline."
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE02_HELP    #language eng "The range of the setting is (0~15) This setting has to be specified basing on platform design and following the guideline."
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE03_HELP    #language eng "The range of the setting is (0~15) This setting has to be specified basing on platform design and following the guideline."
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE04_HELP    #language eng "The range of the setting is (0~15) This setting has to be specified basing on platform design and following the guideline."
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE05_HELP    #language eng "The range of the setting is (0~15) This setting has to be specified basing on platform design and following the guideline."
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE06_HELP    #language eng "The range of the setting is (0~15) This setting has to be specified basing on platform design and following the guideline."
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE07_HELP    #language eng "The range of the setting is (0~15) This setting has to be specified basing on platform design and following the guideline."

#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE_VALUE_FORM    #language eng "PCIe Gen3 RxCTLEp Setting"
#string STR_PCIE_GEN3_RXCTLEP_PER_BUNDLE_VALUE_HELP    #language eng "The range of the setting for perbundle is (0~15) This setting has to be specified basing on platform design and following the guideline"

#string STR_INT_PCIE_ASPM_AFTER_OPROM_PROMPT #language eng "Program PCIe ASPM after OpROM"
#string STR_INT_PCIE_ASPM_AFTER_OPROM_HELP   #language eng "Enabled: PCIe ASPM will be programmed after OpROM. Disabled: PCIe ASPM will be programmed before OpROM."
#string STR_ALL_PERST_GPIO_USAGE_PROMPT      #language eng "  Allow PERST# GPIO Usage"
#string STR_ALL_PERST_GPIO_USAGE_HELP        #language eng "Enable or disable GPIO-based resets to PEG endpoint(s) during margin search, if needed"

//----------------------------------------------------------------------------
// Common String
//----------------------------------------------------------------------------
#string STR_EMPTY_STRING                #language eng ""
#string STR_COMMON_AUTO                 #language eng "Auto"

#string STR_COMMON_ENABLED              #language eng "Enabled"

#string STR_COMMON_DISABLED             #language eng "Disabled"

#string STR_COMMON_NORMAL               #language eng "Normal"

#string STR_COMMON_MANUAL               #language eng "Manual"

#string STR_COMMON_GEN1                 #language eng  "Gen1"
#string STR_COMMON_GEN2                 #language eng  "Gen2"
#string STR_COMMON_GEN3                 #language eng  "Gen3"
#string STR_COMMON_PEG0                 #language eng  "PEG10"
#string STR_COMMON_PEG1                 #language eng  "PEG11"
#string STR_COMMON_PEG2                 #language eng  "PEG12"
#string STR_COMMON_PCIE0                 #language eng  "PCIE0"
#string STR_COMMON_PCIE1                 #language eng  "PCIE1"
#string STR_COMMON_PCIE2                 #language eng  "PCIE2"
#string STR_COMMON_PCIE3                 #language eng  "PCIE3"
#string STR_COMMON_PCIE4                 #language eng  "PCIE4"
#string STR_COMMON_PCIE5                 #language eng  "PCIE5"
#string STR_COMMON_PCIE6                 #language eng  "PCIE6"
#string STR_COMMON_PCIE7                 #language eng  "PCIE7"
#string STR_COMMON_BIT06              #language eng "BIT06"
#string STR_COMMON_BIT07              #language eng "BIT07"
#string STR_COMMON_BIT08              #language eng "BIT08"
#string STR_COMMON_BIT09              #language eng "BIT09"
//#### string <string name>                   #language eng ""

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************